app/controllers/host_data_controller.rb

    def index
      @host_datas = HostData.find(:all)
---
SELECT * FROM `host_datas` WHERE (`host_datas`.`id` IN (1,10))
SELECT * FROM `hostdatas` WHERE (`hostdatas`.`id` = 3)

    def show

      @host_data = HostData.find(params[:id])
---
SELECT * FROM `hostdatas` WHERE (`hostdatas`.`id` = 1)

    def delete
      @host_data = HostData.find(params[:id]).destroy
---
DELETE FROM `host_datas` WHERE `id` = 1
SELECT * FROM `host_datas` WHERE (`host_datas`.`id` = 1)

    def statistics

      @host_data = HostData.count
       @host = HostData.find(:all, :conditions=>{:Date_created =>(Date.today)})
---
SELECT count(*) AS count_all FROM `host_datas`
SELECT * FROM `host_datas` WHERE (`host_datas`.`Date_created` BETWEEN '2011-06-02' AND '2011-06-09')