app/controllers/hostname_controller.rb

SELECT * FROM `hostnames` WHERE (`hostnames`.`id` = 1)
---
  def list
    @hostnames = Hostname.find(:all)

INSERT INTO `hostnames` (`created_at`, `updated_at`, `hostid`, `mac_address`, `hostname`, `ip_address`) VALUES('2011-06-02 10:43:55', '2011-06-02 10:43:55', NULL, '', 'kondwa', '')
---
  def create
    @hostname = Hostname.new(params[:hostname])
    if @hostname.save

DELETE FROM `hostnames` WHERE `id` = 1
SELECT * FROM `hostnames` WHERE (`hostnames`.`id` = 1)
---
    def delete
     Hostname.find(params[:id]).destroy